tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
brew "bash"
brew "bat"
brew "coreutils"
brew "exiftool"
brew "eza"
brew "fzf"
brew "gawk"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "gzip"
brew "hledger"
brew "htop"
brew "jq"
brew "less"
brew "lnav"
brew "md5deep"
brew "miller"
brew "nmap"
brew "ollama"
brew "openssh"
brew "pkgconf"
brew "pv"
brew "ripgrep"
brew "rsync"
brew "rustup"
brew "shellcheck"
brew "tmux"
brew "unzip"
brew "uv"
brew "vim"
brew "yara"
brew "ykman"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
cask "appcleaner"
cask "claude-code"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "hex-fiend"
cask "keka"
cask "mitmproxy"
cask "obsidian"
cask "quarto"
cask "raycast"
cask "spotify"
cask "visual-studio-code"
cask "windowkeys"
cask "wireshark-app"
vscode "anthropic.claude-code"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "esbenp.prettier-vscode"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
cargo "cargo-machete"
cargo "jsonschema-cli"
