tap "hashicorp/tap"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
brew "ansible"
brew "asciinema"
brew "aws-iam-authenticator"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "binutils"
brew "coreutils"
brew "diffutils"
brew "eza"
brew "ffmpeg"
brew "file-formula"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gimme-aws-creds"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gnutls"
brew "grep"
brew "gzip"
brew "hledger"
brew "htop"
brew "webp"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli"
brew "less"
brew "md5deep"
brew "miniserve"
brew "ollama"
brew "openssh"
brew "pkgconf"
brew "pwgen"
brew "pytest", link: false
brew "rsync"
brew "rustup"
brew "shellcheck"
brew "tmux"
brew "unzip"
brew "uv"
brew "vim"
brew "wdiff"
brew "wget"
brew "ykman"
brew "yq"
brew "zola"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "hashicorp/tap/terraform"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
cask "appcleaner"
cask "claude-code"
cask "docker-desktop"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "hex-fiend"
cask "inkscape"
cask "keka"
cask "obsidian"
cask "quarto"
cask "raycast"
cask "spotify"
cask "visual-studio-code"
cask "windowkeys"
vscode "anthropic.claude-code"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "esbenp.prettier-vscode"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
cargo "cargo-machete"
cargo "jsonschema-cli"
cargo "rustlings"
